# OpacityByClass

## Description
Sets the document default settings to the opacity of the active class.

```pascal
PROCEDURE OpacityByClass;
```

```python

def vs.OpacityByClass():
    return None
```

## Remarks
Sets the global attributes to use the opacityof the default class.

## Version
Availability: from VectorWorks 2008
## Category
* Classes